<script setup>
const route = useRoute();

const entries = ref([]);
const firstDate = ref('');
const hasResults = ref(true);
const selectedCities = ref(route.query.cities?.split('_') || []);
let query = {};
if (selectedCities.value.length) {
  query.cities = selectedCities.value;
}

const { data } = await useFetch('/api/cities', { query });
entries.value = data.value.entries;
firstDate.value = data.value.firstDate;

const description = 'מערכת שמנתחת את התפלגות האזעקות לפי אזורים נבחרים ומציגה את התוצאות על גבי תצוגה נוחה לקריאה';
const siteTitle = computed(() => {
  let title = 'Safer Times - אזעקות לפי זמנים';
  if (selectedCities.value.length) {
    title += ` - ${selectedCities.value.join(' | ')}`;
  }
  return title;
});

useSeoMeta({
  title: siteTitle,
  ogTitle: siteTitle,
  description: description,
  ogDescription: description,
  ogImage: '/favicon.png',
})

useHead({
  title: siteTitle,
  link: [
    { rel: 'icon', type: 'image/png', href: '/favicon.png' }
  ],
  bodyAttrs: {
    dir: 'rtl'
  }
})

const cities = ["אזור תעשייה שחורת", "אילות", "אילת", "ארגמן", "בקעות", "גיתית", "גלגל", "חמדת", "חמרה", "ייט''ב", "יפית", "מבואות יריחו", "מחולה", "מכורה", "מעלה אפרים", "משואה", "משכיות", "נעמה", "נערן", "נתיב הגדוד", "פצאל", "רועי", "רותם", "שדמות מחולה", "תומר", "אזור תעשייה צבאים", "בית אלפא וחפציבה", "בית אלפא וחפציבה", "בית השיטה", "בית יוסף", "בית שאן", "גני חוגה", "גשר", "חוות עדן", "חמדיה", "טייבה בגלבוע", "טירת צבי", "ירדנה", "כפר גמילה מלכישוע", "כפר רופין", "מולדת", "מירב", "מנחמיה", "מסילות", "מעוז חיים", "מעלה גלבוע", "מתחם סקי גלבוע", "נוה איתן", "נווה אור", "ניר דוד", "עין הנצי''ב", "רוויה", "רחוב", "רשפים", "שדה אליהו", "שדה נחום", "שדי תרומות", "שלוחות", "שלפים", "תל תאומים", "אבני איתן", "אזור תעשייה בני יהודה", "אלוני הבשן", "אלי עד", "אלמגור", "אניעם", "אפיק", "אשדות יעקב", "אשדות יעקב", "בני יהודה וגבעת יואב", "בני יהודה וגבעת יואב", "גשור", "האון", "חד נס", "חוף גולן, צאלון", "חוף גופרה", "חוף כורסי, לבנון, חלוקים", "חוף כינר, דוגה, דוגית", "חוף סוסיתא", "חמת גדר", "חספין", "יונתן", "כנף", "כפר חרוב", "מבוא חמה", "מיצר", "מסדה", "מעגן", "מעלה גמלא", "נאות גולן", "נוב", "נטור", "עין גב", "צמח", "קדמת צבי", "קצרין", "קצרין - אזור תעשייה", "קשת", "רמות", "רמת מגשימים", "שער הגולן", "תל קציר", "אודם", "אורטל", "אל רום", "בוקעתא", "מג'דל שמס", "מסעדה", "מצוק עורבים", "מרום גולן", "נווה אטי''ב", "נמרוד", "עין זיוון", "עין קנייא", "רמת טראמפ", "שעל", "אבו סנאן", "אור הגנוז", "אזור תעשייה בר-לב", "אזור תעשייה חצור הגלילית", "אזור תעשייה כרמיאל", "אזור תעשייה צ.ח.ר", "אזור תעשייה שער נעמן", "אחיהוד", "איילת השחר", "אליפלט", "אמירים", "אמנון", "אפק", "אשרת", "בוסתן הגליל", "ביריה", "בית ג'אן", "בית העלמין החדש עכו", "בית העמק", "בענה", "בר יוחאי", "גדות", "ג'דידה מכר", "ג'וליס", "גיתה", "דיר אל-אסד", "הר חלוץ", "חולתה", "חוף אמנון", "חצור הגלילית", "חרשים", "טבחה", "טובא זנגריה", "טל - אל", "ינוח ג'ת", "יסוד המעלה", "יסעור", "ירכא", "כורזים ורד הגליל", "כחל", "כישור", "כליל", "כמאנה", "כמון", "כסרא סמיע", "כפר הנשיא", "כפר יאסיף", "כפר מסריק", "כפר נחום", "כפר שמאי", "כרכום", "כרמיאל", "לבון", "לוחמי הגטאות", "לפידות", "מג'דל כרום", "מגדל תפן", "מזרעה", "מחניים", "מירון", "מכמנים", "מלון אחוזת ירדן", "מלון פרא", "מנחת מחניים", "מרכז אזורי מרום גליל", "משמר הירדן", "נחף", "נס עמים", "נתיב השיירה", "סאג'ור", "ספסופה - כפר חושן", "עין אל אסד", "עין המפרץ", "עין כמונים", "עכו", "עכו - אזור תעשייה", "עמוקה", "עמיעד", "עמקה", "פלך", "פרוד", "צורית גילון", "צורית גילון", "צפת - נוף כנרת", "צפת - עיר", "צפת - עכברה", "קדיתא", "קדרים", "ראמה", "ראש פינה", "רגבה", "שבי ציון", "שדה אליעזר", "שומרת", "שזור", "שייח' דנון", "שפר", "תובל", "אזור תעשייה קדמת גליל", "אלומות", "אפיקים", "ארבל", "אתר ההנצחה גולני", "בית זרע", "בית ירח", "גבעת אבני", "גינוסר", "דגניה א", "דגניה ב", "הודיות", "הזורעים", "ואדי אל חמאם", "חוקוק", "טבריה", "יבנאל", "כינרת מושבה", "כינרת קבוצה", "כפר זיתים", "כפר חיטים", "כפר כמא", "כפר נהר הירדן", "לביא", "לבנים", "מגדל", "מצפה", "נבי שועייב", "פוריה כפר עבודה", "פוריה נווה עובד", "פוריה עילית", "רביד", "רפטינג נהר הירדן", "שדה אילן", "שרונה", "אור יהודה", "אזור", "בית עלמין מורשה", "בני ברק", "בת ים", "גבעת השלושה", "גבעת שמואל", "גבעתיים", "גני תקווה", "גת רימון", "הרצליה - מערב", "הרצליה - מרכז וגליל ים", "הרצליה - מרכז וגליל ים", "חולון", "יהוד מונוסון", "כל הארץ", "כפר סירקין", "כפר שמריהו", "מגשימים", "מעש", "מקווה ישראל", "מתחם פי גלילות", "סביון", "סינמה סיטי גלילות", "פתח תקווה", "קריית אונו", "רמת גן - מזרח", "רמת גן - מערב", "רמת השרון", "תל אביב - דרום העיר ויפו", "תל אביב - מזרח", "תל אביב - מרכז העיר", "תל אביב - עבר הירקון", "אבו קרינאת", "אבו תלול", "אורון תעשייה ומסחר", "אזור תעשייה דימונה", "אזור תעשייה רותם", "אל פורעה", "אשלים", "באר מילכה", "ביר הדאג'", "בית סוהר נפחא", "דימונה", "הר הנגב", "ואדי אל נעם דרום", "חירן", "טללים", "ירוחם", "כמהין", "כסייפה", "כפר הנוקדים", "מדרשת בן גוריון", "ממשית", "מצפה רמון", "מרחב עם", "מרעית", "משאבי שדה", "ניצנה", "סעווה", "עבדת", "עזוז", "ערד", "ערערה בנגב", "קדש ברנע", "קסר א-סר", "רביבים", "רתמים", "שאנטי במדבר", "שדה בוקר", "תל ערד", "אזור תעשייה ניר עציון", "בית אורן", "בית סוהר קישון", "בית צבי", "בת שלמה", "גבע כרמל", "גבעת וולפסון", "דור", "דלית אל כרמל", "הבונים", "יערות הכרמל", "כלא דמון", "כפר הנוער ימין אורד", "כרם מהר''ל", "מאיר שפיה", "מגדים", "מרכז מיר''ב", "נווה ים", "נחשולים", "ניר עציון", "עופר", "עין איילה", "עין הוד", "עין חוד", "עין כרמל", "עספיא", "עתלית", "פוריידיס", "צרופה", "אושה", "אזור תעשייה קריית ביאליק", "איבטין", "בית עלמין תל רגב", "יגור", "כפר ביאליק", "כפר המכבי", "כפר חסידים", "כפר חסידים", "קריית אתא", "קריית ביאליק", "קריית ים", "קריית מוצקין", "רכסים", "רמת יוחנן", "אום אלג'נם", "אורנים", "אזור תעשייה אלון התבור", "אזור תעשייה מבואות הגלבוע", "אזור תעשייה ציפורית", "אחוזת ברק", "אילניה", "אכסאל", "אלון הגליל", "אלוני אבא", "אלונים", "אל-ח'וואלד מערב", "בית לחם הגלילית", "בית סוהר שיטה וגלבוע", "בית קשת", "בית שערים", "בלפוריה", "בסמת טבעון", "גבעת אלה", "גבת", "גדעונה", "גזית", "גן נר", "גניגר", "דבוריה", "דברת", "דחי", "הושעיה", "היוגב", "הסוללים", "הרדוף", "זרזיר", "חג'אג'רה", "חוואלד", "ח'וואלד", "טמרה בגלבוע", "יזרעאל", "יפיע", "יפעת", "ישובי אומן", "ישובי יעל", "ישובי יעל", "ישובי יעל", "ישובי יעל", "כדורי", "כעביה", "כעביה טבאש", "כפר ברוך", "כפר גדעון", "כפר החורש", "כפר טבאש", "כפר יהושע", "כפר יחזקאל", "כפר כנא", "כפר מצר", "כפר קיש", "כפר תבור", "כפר תקווה", "מגדל העמק", "מגן שאול", "מוקיבלה", "מזרע", "מנשית זבדה", "מרחביה מושב", "מרחביה קיבוץ", "מרכז חבר", "מרכז חבר", "מרכז חבר", "מרכז חבר", "משהד", "נאעורה", "נהלל", "נוף הגליל", "נופית", "נורית", "נין", "נצרת", "סואעד חמירה", "סולם", "סנדלה", "עדי", "עילוט", "עין דור", "עין חרוד", "עין חרוד", "עין מאהל", "עפולה", "ציפורי", "קבוצת גבע", "קריית טבעון - בית זייד", "ראס עלי", "ריינה", "רם און", "רמת דוד", "רמת ישי", "רמת צבי", "שבלי", "שדה יעקב", "שדמות דבורה", "שמשית", "שער העמקים", "שריד", "תחנת רכבת כפר ברוך", "תחנת רכבת כפר יהושוע", "תל יוסף", "תל עדשים", "תמרת", "אזור תעשייה נשר - רמלה", "אזור תעשייה רגמ", "אחיסמך", "אחיעזר", "אירוס", "באר יעקב", "בית דגן", "בית חנן", "בית חשמונאי", "בית עובד", "בית עוזיאל", "בן שמן", "גאליה", "גזר", "גיבתון", "גינתון", "גן שורק", "גן שלמה", "גנות", "גני הדר", "גני יוחנן", "זיתן", "חולדה", "חמד", "חניון הנתיב מהיר", "יגל", "יד רמב''ם", "יסודות", "יציץ", "ישרש", "כפר ביל''ו", "כפר בן נון", "כפר חב''ד", "כפר נוער בן שמן", "כפר שמואל", "כרמי יוסף", "לוד", "מזכרת בתיה", "מצליח", "משמר איילון", "משמר דוד", "משמר השבעה", "נטעים", "ניר צבי", "נס ציונה", "נען", "נצר חזני", "נצר סרני", "סתריה", "עזריה", "עיינות", "פארק תעשיות פלמחים", "פדיה", "פתחיה", "צפריה", "קריית עקרון", "ראשון לציון - מזרח", "ראשון לציון - מערב", "רחובות", "רמות מאיר", "רמלה", "תעשיון צריפין", "אום אל פחם", "אום אל קוטוף", "אזור תעשייה יקנעם עילית", "אזור תעשייה מבוא כרמל", "אל עריאן", "אליקים", "באקה אל גרבייה", "בית סוהר מגידו", "ברטעה", "גבעת ניל''י", "גבעת עוז", "גלעד", "ג'ת", "דליה", "חריש", "יקנעם המושבה והזורע", "יקנעם המושבה והזורע", "יקנעם עילית", "כפר קרע", "מגל", "מדרך עוז", "מועאוויה", "מי עמי", "מייסר", "מעלה עירון", "מצפה אילן", "מצר", "משמר העמק", "עין אל סהלה", "עין העמק", "עין השופט", "ערערה", "קיבוץ מגידו", "קציר", "רגבים", "רמות מנשה", "רמת השופט", "אבו נוור", "אדורה", "אדוריים", "אזור תעשייה מישור אדומים", "אזור תעשייה מיתרים", "אלון", "אלון שבות", "אליאב", "אלעזר", "אמציה", "אפרת", "בית חג\"י", "בית יתיר", "ביתר עילית", "בני דקלים", "בת עין", "גבעות", "היישוב היהודי חברון", "הר גילה", "הר עמשא", "טנא עומרים", "כפר אדומים", "כפר אלדד", "כפר עציון", "כרמי צור", "כרמי קטיף", "כרמל", "מגדל עוז", "מיצד", "מעון", "מעלה אדומים", "מעלה חבר", "מעלה עמוס", "מעלה רחבעם", "מצפה יריחו", "נגוהות", "נווה דניאל", "נופי פרת", "נוקדים", "נטע", "סוסיא", "עלמון", "עשהאל", "עתניאל", "פארק תעשיות מגדל עוז", "פני קדם", "צומת הגוש", "קידר", "קריית ארבע", "ראש צורים", "שדה בר", "שומריה", "שמעה", "שני ליבנה", "שקף", "תלם", "תקוע", "אבנת", "אלמוג", "בית הערבה", "בתי מלון ים המלח", "ורד יריחו", "חוף קליה", "מלונות ים המלח מרכז", "מצדה", "מצוקי דרגות", "מצפה שלם", "מרחצאות עין גדי", "מרכז אזורי מגילות", "נאות הכיכר", "נווה זוהר", "עין בוקק", "עין גדי", "עין תמר", "קליה", "אבן ספיר", "אורה", "בית זית", "גבעון החדשה", "גבעת זאב", "ירושלים - אזור תעשייה עטרות", "ירושלים - דרום", "ירושלים - כפר עקב", "ירושלים - מזרח", "ירושלים - מערב", "ירושלים - מרכז", "ירושלים - צפון", "מבשרת ציון", "מוצא עילית", "נבי סמואל", "עמינדב", "פנימיית עין כרם", "אזור תעשייה אפק ולב הארץ", "אזור תעשייה חבל מודיעין", "איירפורט סיטי", "אלעד", "בארות יצחק", "בית נחמיה", "בית עריף", "בני עטרות", "ברקת", "גבעת כ''ח", "גמזו", "חדיד", "חשמונאים", "טירת יהודה", "כפר דניאל", "כפר האורנים", "כפר טרומן", "כפר רות", "לפיד", "מבוא חורון", "מבוא מודיעים", "מודיעין - ישפרו סנטר", "מודיעין - ליגד סנטר", "מודיעין מכבים רעות", "מודיעין עילית", "מזור", "מתתיהו", "נאות קדומים", "נוף איילון", "נופך", "נחלים", "נחשונים", "עינת", "ראש העין", "רינתיה", "שוהם", "שילת", "שעלבים", "תעשיון חצב", "אביגדור", "אבן שמואל", "אורות", "אזור תעשייה באר טוביה", "אזור תעשייה גדרה", "אזור תעשייה כנות", "אזור תעשייה עד הלום", "אזור תעשייה קריית גת", "אזור תעשייה רבדים", "אזור תעשייה תימורים", "אחווה", "אחוזם", "איתן", "אל עזי", "אלומה", "אמונים", "אשדוד - א,ב,ד,ה", "אשדוד - איזור תעשייה צפוני", "אשדוד - ג,ו,ז", "אשדוד - ח,ט,י,יג,יד,טז", "אשדוד -יא,יב,טו,יז,מרינה,סיטי", "באר טוביה", "ביצרון", "בית אלעזרי", "בית גמליאל", "בית חלקיה", "בית עזרא", "בן זכאי", "בני דרום", "בני עי''ש", "בני ראם", "בניה", "גבעת ברנר", "גבעת וושינגטון", "גבעתי", "גדרה", "גן הדרום", "גן יבנה", "גני טל", "גת", "ורדון", "זבדיאל", "זוהר", "זרחיה", "חפץ חיים", "חצב", "חצור", "יבנה", "יד בנימין", "יד נתן", "ינון", "כנות", "כפר אביב", "כפר אחים", "כפר הנגיד", "כפר הרי''ף וצומת ראם", "כפר ורבורג", "כפר מרדכי", "כרם ביבנה", "לכיש", "מישר", "מנוחה", "מעון צופיה", "מפעל אגריגדה", "מרכז שפירא", "משגב דב", "משואות יצחק", "מתחם בני דרום", "נגבה", "נהורה", "נוגה", "נווה מבטח", "נועם", "נחלה", "ניר בנים", "ניר גלים", "ניר ח''ן", "סגולה", "עוזה", "עוצם", "עזר", "עזריקם", "עין צורים", "ערוגות", "עשרת", "פארק תעשייה ראם", "פלמחים", "קבוצת יבנה", "קדמה", "קדרון", "קוממיות", "קריית גת, כרמי גת", "קריית מלאכי", "רבדים", "רווחה", "שדה דוד", "שדה יואב", "שדה משה", "שדה עוזיהו", "שדמה", "שחר", "שלווה", "שפיר", "שתולים", "תחנת רכבת קריית מלאכי - יואב", "תימורים", "תלמי יחיאל", "תלמים", "אביאל", "אור עקיבא", "אזור תעשייה קיסריה", "אזור תעשייה רגבים", "אלוני יצחק", "בית חנניה", "בית ספר אורט בנימינה", "בנימינה", "ברקאי", "גבעת חביבה", "גבעת עדה", "גן השומרון", "גן שמואל", "ג'סר א-זרקא", "החותרים", "זכרון יעקב", "חדרה - מזרח", "חדרה - מערב", "חדרה - מרכז", "חדרה - נווה חיים", "חיפה - כרמל, הדר ועיר תחתית", "חיפה - מערב", "חיפה - מפרץ", "חיפה - נווה שאנן ורמות כרמל", "חיפה - קריית חיים ושמואל", "טירת כרמל", "כפר גלים", "כפר גליקסון", "כפר פינס", "להבות חביבה", "מאור", "מעגן מיכאל", "מעיין צבי", "מענית", "מרכז ימי קיסריה", "משמרות", "מתחם שביל התפוזים", "נשר", "עין עירון", "עין שמר", "עמיקם", "פרדס חנה כרכור", "צומת בנימינה", "קיסריה", "רמת הנדיב", "שדה יצחק", "שדות ים", "שער מנשה", "תלמי אלעזר", "אופקים", "אורים", "אזור תעשייה נ.ע.מ", "אשבול", "אשל הנשיא", "בטחה", "בית הגדי", "ברור חיל", "ברוש", "ברחבי הארץ", "גבולות", "גילת", "דורות", "דניאל", "זרועה", "חוות שיקמים", "יושיביה", "מבועים", "מסלול", "מעגלים, גבעולים, מלילות", "מעגלים, גבעולים, מלילות", "מעגלים, גבעולים, מלילות", "ניר משה", "ניר עקיבא", "נתיבות", "פדויים", "פטיש", "פעמי תש''ז", "צאלים", "קלחים", "קריית חינוך מרחבים", "רוחמה", "רנן", "שבי דרום", "שדה צבי", "שיבולים", "שרשרת", "תאשור", "תדהר", "תלמי ביל''ו", "תפרח", "אזור תעשייה הדרומי אשקלון", "אזור תעשייה צפוני אשקלון", "אשקלון - דרום", "אשקלון - צפון", "באר גנים", "בית שקמה", "ברכיה", "בת הדר", "גיאה", "הודיה", "חוף ניצנים", "חלץ", "כוכב מיכאל", "כפר סילבר", "מבקיעים", "משען", "ניצן", "ניצן", "ניצנים", "ניר ישראל", "תלמי יפה", "אבטליון", "אזור תעשייה טמרה", "אזור תעשייה תרדיון", "אעבלין", "אשבל", "אשחר", "בועיינה-נוג'ידאת", "ביר אלמכסור", "בית סוהר צלמון", "בית רימון", "דיר חנא", "דמיידה", "הררית יחד", "חוסנייה", "חזון", "חנתון", "טורעאן", "טמרה", "טפחות", "יובלים", "יודפת", "יעד", "כאבול", "כאוכב אבו אלהיג'א", "כלנית", "כפר חנניה", "כפר מנדא", "לוטם וחמדון", "מורן", "מורשת", "מנוף", "מסד", "מע'אר", "מעלה צביה", "מצפה אבי''ב", "מצפה נטופה", "מרכז אזורי משגב", "סכנין", "סלמה", "עוזייר", "עילבון", "עינבר", "עצמון - שגב", "עראבה", "ערב אל נעים", "קורנית", "ראס אל-עין", "רומאנה", "רומת אל הייב", "רקפת", "שורשים", "שכניה", "שעב", "שפרעם", "אום בטין", "אזור תעשייה עידן הנגב", "אל סייד", "אשכולות", "אתר דודאים", "באר שבע - דרום", "באר שבע - מזרח", "באר שבע - מערב", "באר שבע - צפון", "בית קמה", "גבעות בר", "גבעות גורל", "דביר", "חורה", "חצרים", "כרמים", "כרמית", "להב", "להבים", "לקיה", "מיתר", "משמר הנגב", "מתחם צומת שוקת", "נבטים", "סנסנה", "עומר", "צומת דבירה", "רהט", "שגב שלום", "שובל", "תארבין", "תל שבע", "אבשלום", "אור הנר", "ארז", "בארי", "בני נצרים", "גבים, מכללת ספיר", "גברעם", "דקל", "זיקים", "זמרת, שובה", "זמרת, שובה", "חוות יזרעם", "חולית", "חוף זיקים", "יבול", "יד מרדכי", "יכיני", "יתד", "כיסופים", "כפר מימון ותושיה", "כפר מימון ותושיה", "כפר עזה", "כרם שלום", "כרמיה", "מבטחים, עמיעוז, ישע", "מבטחים, עמיעוז, ישע", "מבטחים, עמיעוז, ישע", "מגן", "מטווח ניר עם", "מפלסים", "נווה", "נחל עוז", "ניר יצחק", "ניר עוז", "ניר עם", "נירים", "נתיב העשרה", "סופה", "סעד", "עין הבשור", "עין השלושה", "עלומים", "פרי גן", "צוחר, אוהד", "צוחר, אוהד", "רעים", "שדה ניצן", "שדי אברהם", "שדרות, איבים", "שדרות, איבים", "שוקדה", "שלומית", "תלמי אליהו", "תלמי יוסף", "תקומה", "אל עמארני, אל מסק", "אליפז ומכרות תמנע", "באר אורה", "גרופית", "חוות ערנדל", "חי-בר יטבתה", "חצבה", "יהל", "יטבתה", "כושי רמון", "לוטן", "מלון סיקס סנסס שחרות", "נאות סמדר", "נווה חריף", "סמר", "ספיר", "עידן", "עין חצבה", "עין יהב", "עיר אובות", "פארן", "צופר", "צוקים", "קטורה", "שחרות", "שיטים", "אביבים", "אבירים", "אבן מנחם", "אדמית", "אזור תעשייה מילואות צפון", "אזור תעשייה רמת דלתון", "אילון", "אלקוש", "בית הלל", "בית העלמין החדש נהריה", "בית ספר שדה מירון", "בן עמי", "בצת", "ברעם", "גונן", "גורן", "גורנות הגליל", "געתון", "ג'ש - גוש חלב", "גשר הזיו", "דוב''ב", "דישון", "דלתון", "דפנה", "הגושרים", "הילה", "זרעית", "חוות אירוח גורן", "חוסן", "חוף בצת", "חורפיש", "חניתה", "יחיעם", "יערה", "יפתח", "יראון", "כברי", "כפר בלום", "כפר גלעדי", "כפר ורדים", "כפר יובל", "כפר סאלד", "כרם בן זמרה", "לב החולה", "להבות הבשן", "לימן", "מטולה", "מלכיה", "מנות", "מנרה", "מעונה", "מעיין ברוך", "מעיליא", "מעלות תרשיחא", "מצובה", "מרגליות", "מרכז אזורי מבואות חרמון", "משגב עם", "מתת", "נאות מרדכי", "נהריה", "נווה זיו", "נטועה", "סאסא", "סער", "עבדון", "עברון", "ע'ג'ר", "עין יעקב", "עלמה", "עמיר", "ערב אל עראמשה", "פסוטה", "פקיעין", "פקיעין החדשה", "צבעון", "צוריאל", "קיבוץ דן", "קריית שמונה", "ראש הנקרה", "ריחאנייה", "רמות נפתלי", "שאר ישוב", "שדה נחמיה", "שומרה", "שלומי", "שמיר", "שניר", "שתולה", "תל חי", "אבני חפץ", "אזור תעשייה אריאל", "אזור תעשייה בראון", "אזור תעשייה ברקן", "אזור תעשייה שחק", "אזור תעשייה שער בנימין", "אחיה", "איתמר", "אלון מורה", "אריאל", "בית אל", "בית אריה", "בית חורון", "ברוכין", "ברקן", "גבע בנימין", "גבעת אסף", "גבעת הראל וגבעת הרואה", "דולב", "הר ברכה", "חוות גלעד", "חוות יאיר", "חיננית", "חלמיש", "חרמש", "חרשה", "טל מנשה", "טלמון", "יצהר", "יקיר", "כוכב השחר", "כוכב יעקב", "כפר תפוח", "כרם רעים", "מבוא דותן", "מגדלים", "מגרון", "מעלה לבונה", "מעלה מכמש", "נופי נחמיה", "נופים", "נחליאל", "נילי", "נעלה", "נריה", "עדי עד", "עופרים", "עטרת", "עלי", "עלי זהב", "עמיחי", "עמנואל", "ענב", "עפרה", "פדואל", "פסגות", "קדומים", "קידה", "קריית נטפים", "קרני שומרון", "רבבה", "רחלים", "ריחן", "רימונים", "שבות רחל", "שבי שומרון", "שילה", "שקד", "תל ציון", "אבו גוש", "אביעזר", "אדרת", "אזור תעשייה ברוש", "אזור תעשייה הר טוב - צרעה", "אשתאול", "בית גוברין", "בית מאיר", "בית ניר", "בית נקופה", "בית שמש", "בקוע", "בר גיורא", "גבעות עדן", "גבעת יערים", "גבעת ישעיהו", "גיזו", "גלאון", "גפן", "הר אדר", "הראל", "זכריה", "זנוח", "טל שחר", "יד השמונה", "ישעי", "כסלון", "כפר אוריה", "כפר הנוער קריית יערים", "כפר זוהרים", "כפר מנחם", "לוזית", "לטרון", "מבוא ביתר", "מחסיה", "מטע", "מיני ישראל - נחשון", "מסילת ציון", "מעלה החמישה", "נווה אילן", "נווה מיכאל - רוגלית", "נווה שלום", "נחושה", "נחם", "נחשון", "נטף", "נס הרים", "נתיב הל''ה", "עגור", "עין נקובא", "עין ראפה", "צובה", "צומת האלה", "צור הדסה", "צלפון", "צפרירים", "צרעה", "קריית יערים", "קריית ענבים", "רטורנו - גבעת שמש", "רמת רזיאל", "שדות מיכה", "שואבה", "שורש", "שער הגיא", "שריגים - לי-און", "תירוש", "תעוז", "תרום", "אביחיל", "אבן יהודה", "אודים", "אורנית", "אזור תעשייה טירה", "אזור תעשייה כפר יונה", "אזור תעשייה עמק חפר", "אחיטוב", "אייל", "אליכין", "אלישיב", "אלישמע", "אלפי מנשה", "אלקנה", "אמץ", "ארסוף", "בארותיים", "בורגתה", "בחן", "בית ברל", "בית הלוי", "בית חזון", "בית חרות", "בית יהושע", "בית ינאי", "בית יצחק - שער חפר", "בית סוהר השרון", "ביתן אהרן", "בני דרור", "בני ציון", "בצרה", "בת חן", "בת חפר", "גאולי תימן", "גאולים", "גבעת חיים איחוד", "גבעת חיים מאוחד", "גבעת חן", "גבעת שפירא", "ג'לג'וליה", "גן חיים", "גן יאשיה", "גנות הדר", "גני עם", "געש", "הדר עם", "הוד השרון", "המעפיל", "המרכז האקדמי רופין", "העוגן", "זמר", "חבצלת השרון וצוקי ים", "חבצלת השרון וצוקי ים", "חגור", "חגלה", "חופית", "חורשים", "חיבת ציון", "חניאל", "חרב לאת", "חרוצים", "חרות", "טייבה", "טירה", "יד חנה", "ינוב", "יעף", "יקום", "ירחיב", "ירקונה", "כוכב יאיר - צור יגאל", "כפר ברא", "כפר הס", "כפר הרא''ה", "כפר ויתקין", "כפר חיים", "כפר ידידיה", "כפר יונה", "כפר יעבץ", "כפר מונש", "כפר מל''ל", "כפר נטר", "כפר סבא", "כפר עבודה", "כפר קאסם", "מכון וינגייט", "מכמורת", "מעברות", "מרכז אזורי דרום השרון", "משמר השרון", "משמרת", "מתחם \"חנה וסע\" שפיים", "מתן", "נווה ימין", "נווה ירק", "נורדיה", "ניצני עוז", "ניר אליהו", "נירית", "נעורים", "נתניה - מזרח", "נתניה - מערב", "סלעית", "עדנים", "עולש", "עזריאל", "עין החורש", "עין ורד", "עין שריד", "עץ אפרים", "פורת", "פרדסיה", "צופים", "צופית", "צור יצחק", "צור משה", "צור נתן", "קדימה צורן", "קלנסווה", "רמות השבים", "רמת הכובש", "רעננה", "רשפון", "שדה ורבורג", "שדי חמד", "שושנת העמקים", "שער אפרים", "שערי תקווה", "שפיים", "תחנת רכבת ראש העין", "תל יצחק", "תל מונד", "תנובות"];


const loading = ref(false);
// const chartData = ref();
const chartOptions = ref({
  maintainAspectRatio: false,
  aspectRatio: 0.8,
  plugins: {
    legend: {
      display: false,
    }
  },
  scales: {
    x: {
      ticks: {
        font: {
          weight: 500
        }
      },
      grid: {
        display: false,
        drawBorder: false
      }
    },
    y: {
      grid: {
        display: false,
        drawBorder: false
      }
    }
  }
});

const chartData = computed(() => {
  return {
    labels: ['00:00-06:00', '06:00-12:00', '12:00-14:00', '14:00-16:00', '16:00-18:00', '18:00-20:00', '20:00-22:00', '22:00-00:00'],
    datasets: [
      {
        label: 'התפלגות אזעקות (%)',
        backgroundColor: '#346793',
        borderColor: '#346793',
        data: [
          getPercentageInRange(0, 6),
          getPercentageInRange(6, 12),
          getPercentageInRange(12, 14),
          getPercentageInRange(14, 16),
          getPercentageInRange(16, 18),
          getPercentageInRange(18, 20),
          getPercentageInRange(20, 22),
          getPercentageInRange(22, 24),
        ],
        borderRadius: 60
      }
    ]
  };
});


const getTotalEntriesInRange = (startHour, endHour) => {
  return entries.value.filter(entry => {
    const hour = parseInt(entry.split(':')[0]);
    return hour >= startHour && hour < endHour;
  }).length;
}

const getPercentageInRange = (startHour, endHour) => {
  const total = entries.value.length;
  if (total == 0) {
    return 0;
  }

  return Math.round((getTotalEntriesInRange(startHour, endHour) / total) * 100);
}

const selectCities = async () => {
  const router = useRouter();
  hasResults.value = false;
  entries.value = [];
  loading.value = true;
  const url = new URL('/api/cities', location.href);
  selectedCities.value.forEach(city => url.searchParams.append('cities', city));
  try {
    const response = await fetch(url);
    const data = await response.json();
    entries.value = data.entries;
    firstDate.value = data.firstDate;
    hasResults.value = true;
    if (selectedCities.value.length) {
      router.push({
        path: route.path,
        query: { cities: selectedCities.value.join('_') }
      });
    } else {
      router.push({
        path: route.path,
      });
    }
  } catch (e) {
    console.error(e);
    alert("התרחשה שגיאה")
    hasResults.value = false;
  } finally {
    loading.value = false;
  }
}
</script>

<template>
  <div class="mb-4">
    <div class="flex justify-content-center w-full">
      <div class="logo-container">
        <img src="/images/logo.png" />
      </div>
      <div>
        <div class="flex flex-column justify-content-center mr-2" style="height: 67px">
          <div style="text-align: center;">
            <strong>
              <span style="color: #346793">
                Safer Times
              </span>
              -
              התפלגות אזעקות
              <br />
              לפי אזורי התראה וזמן
            </strong>
          </div>
        </div>
      </div>
    </div>
  </div>

  <section class="loading-results" v-if="loading">
    טוען מידע...
  </section>

  <section class="prompt" v-if="!loading && !hasResults">
    <strong>
      Safer-Times
      הינו כלי המאפשר לכם לצפות בהתפלגות האזעקות בערים שתבחרו בשעות שונות
    </strong>
  </section>

  <section class="results" v-if="!loading && hasResults">
    <div class="stats-info" v-if="entries.length">
      מבוסס על נתונים של
      {{ entries.length }}
      אזעקות
      <span v-if="firstDate">
        מתאריך
        {{ firstDate }}
        ועד היום
      </span>
    </div>
    <!-- pod = part of day, e.g. morning, noon, night-->
    <div class="pod-breakdown-container">
      <div class="grid">
        <PodCube title="בוקר" hoursRange="06:00-12:00" image="/images/morning.png"
          :percentage="getPercentageInRange(6, 12)" />
        <PodCube title="צהריים" hoursRange="12:00-16:00" image="/images/noon.png"
          :percentage="getPercentageInRange(12, 16)" />
        <PodCube title="ערב" hoursRange="16:00-21:00" image="/images/evening.png"
          :percentage="getPercentageInRange(16, 21)" />
        <PodCube title="לילה" hoursRange="21:00-06:00" image="/images/night.png"
          :percentage="getPercentageInRange(21, 24) + getPercentageInRange(0, 6)" />
      </div>

      <Card v-if="entries.length">
        <template #content>
          <Chart type="bar" :data="chartData" :options="chartOptions" style="height:300px;" />
        </template>
      </Card>
    </div>
  </section>

  <div class="sticky-footer">
    <Card class="w-full md:w-10 mx-auto cities-card">
      <template #content class="pb-5">
        <MultiSelect v-model="selectedCities" :options="cities" @change="selectCities" display="chip"
          :showToggleAll="false" filter placeholder="כל האזורים" :virtualScrollerOptions="{ itemSize: 24 }"
          :maxSelectedLabels="3" class="w-full" />

        <div class="credits">

          פותח על ידי
          <a href="https://www.10buy.co.il/?_from=safer-times" target="_blank">10Buy.co.il</a>
          /
          <a href="https://www.drsite.co.il/?_from=safer-times" target="_blank">DrSite.co.il</a>
          בניית אתרים
          |
          <a href="mailto:jerry@djint.net">
            יצירת קשר :)
          </a>
        </div>
      </template>
    </Card>
  </div>
</template>

<style lang="css">
:root {
  --background-color-light: #f8fafc;
  --background-color-dark: #202122;
}

body {
  background-color: var(--background-color-light);
}

/* Dark mode background override */
@media (prefers-color-scheme: dark) {
  body {
    background-color: var(--background-color-dark);
  }
}

body {
  font-family: sans-serif;
  padding-bottom: 90px;
}

.logo-container {
  text-align: center;
  height: 67px;
}

.logo-container img {
  max-height: 100%;
}

.sticky-footer {
  position: fixed;
  width: 100%;
  bottom: 0;
  right: 0;
}

.sticky-footer .cities-card {
  margin-bottom: -10px;
  box-shadow: 0px 0px 55px -13px rgba(52, 103, 147, 1) !important;
}

section.prompt,
section.loading-results {
  text-align: center;
  margin-top: 40px;
  color: rgb(101, 101, 101)
}

.credits {
  text-align: center;
  margin-bottom: 2px;
  margin-top: 5px;
  color: rgb(101, 101, 101);
  font-size: 0.7em;
}

.stats-info {
  color: #949494;
  font-size: 0.8em;
  text-align: center;
  margin-bottom: 5px;
}

.credits>a {
  color: #346793;
  text-decoration: none;
}
</style>
